# 3. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

# text = 'Я люблю Питон.'
# text_2 = 'лю'
# while text_2 in text:
#     text.find(text_2, text, end='.')


#print(text[3,4], test[6,7])

text = 'Я люблю Питон'
text.count('лю')
print(text.count('лю'))